{
  "version": "4.3.0",
  "channel": "stable",
  "summary": "## Stability & Reliability Improvements\n\n### Taskbar Clock Seconds Persistence\n- Fixed an issue where taskbar clock seconds did not persist after enabling/disabling.\n- Registry changes now correctly restart Windows Explorer to apply UI updates.\n- Explorer is stopped and allowed to auto-relaunch with a short delay for consistency.\n\n### Service Restart Handling\n- Improved `RestartAsync` logic to detect disabled services before attempting a restart.\n- Disabled services now return a clear failure message instead of partially executing stop/start logic.\n\n---\n\n## Performance & Memory Optimizations\n\n### Navigation & Memory Leak Fixes\n- Fixed a critical memory leak caused by `SmoothScrollBehavior` not cleaning up event handlers when pages were unloaded.\n- ScrollViewer subscriptions are now properly detached on unload, preventing lingering render ticks.\n- Prevented navigation journal retention by configuring the main frame to own its journal.\n\n### ViewModel Lifecycle Management\n- Added proper disposal to `ProcessPreferencesViewModel` to unhook shared tickers and event handlers when pages are evicted from cache.\n- SmartPageCache now disposes cached ViewModels, keeping the dispatcher and UI thread clean.\n\n### Panel & Visual Tree Cleanup\n- Improved cleanup logic for `VirtualizingAdaptiveTilePanel` and `AdaptiveTilePanel` when removed from the visual tree.\n- Cached layout state, row height data, and owner subscriptions are now released correctly.\n\n---\n\n## UI & UX Enhancements\n\n### Busy State Simplification\n- Simplified the maintenance page busy experience to reduce animation overhead.\n- Replaced animated overlays with a lightweight translucent backdrop, compact card, and indeterminate progress indicator.\n- Reduced UI lag by switching from animated fades to direct opacity and interaction toggles.\n\n### Title Bar Visibility Fix\n- Fixed an issue where title bars disappeared when navigating back to cached pages.\n- Ensured title bars reattach correctly on page visibility changes for cached views.\n\n---\n\n## Virtualization Improvements\n\n- Virtualizing panel now safely falls back to full realization when no `ScrollOwner` or virtualization flags are present.\n- Enabled virtualization across high-cardinality views:\n  - PathPilot runtime grid\n  - Install Hub bundle list\n  - Catalog results\n  - Known Processes catalogs and segments\n  - Performance Lab lists (Templates, Scheduler Processes, AutoTune Processes)\n- Recycling and cache hints added to reduce UI memory usage and improve scrolling performance.\n\n---\n\n## Startup Management Enhancements\n\n### New Startup Detection Types\nAdded detection for previously hidden or legacy startup locations:\n- Winlogon (Shell, Userinit, Taskman)\n- Active Setup components\n- Custom Shell Folder paths\n- Explorer-specific Run keys\n- AppInit DLLs\n- Image File Execution Options (IFEO)\n- BootExecute entries\n\n### Startup Control & Safety\n- Added enable/disable support for new startup types with automatic backup and restore.\n- High-impact startup sources are now classified as system-critical for safety.\n- Background startup guard now enforces these new categories.\n\n---\n\n## Security & Scan Accuracy\n\n### Windows Defender Scan Results\n- Fixed incorrect “Unknown” scan results when Defender returned exit code 0.\n- Clean files now correctly report **Known Good** with clear messaging.\n- Improved user-facing scan messages for Known Good, Known Bad, and Unknown outcomes.\n\n---\n\n## Data Integrity Improvements\n\n- Automatically filters out stale entries where files no longer exist on disk.\n- Persistent storage is auto-cleaned to prevent removed entries from reappearing.",
  "downloadUrl": "https://github.com/Cosmos-0118/TidyWindow/releases/download/v4.3.0/TidyWindow-Setup-4.3.0.exe",
  "releaseNotesUrl": "https://github.com/Cosmos-0118/TidyWindow/releases/tag/v4.3.0",
  "publishedAt": "2026-01-29T16:02:00Z",
  "installerSizeBytes": 91155241,
  "sha256": "9f9df93589035e54bc1c369539ee75f5e1d5561962f3f6084c17d09f8b1e8326"
}
