{
  "version": "4.1.0",
  "channel": "stable",
  "summary": "##  Final Frequent Update (Promise 😅)\n\nThis is the **final frequent update** -> sorry for spamming new versions so often.  \nFrom now on, **new releases will be weekly or monthly**.  \nMost of the major bugs and performance issues are now fixed and the app is in a much more stable state. 💙\n\n---\n\n##  Performance, Lifecycle & Responsiveness Fixes\n\n###  PathPilot\n- Added full **page lifecycle awareness**: background work cancels on hide/unload/navigation.\n- ViewModel now tracks active state and skips applying results after deactivation.\n- Prevents lingering PowerShell scripts and post-navigation UI/log churn.\n- Inventory refresh, switching, and script execution are cancellation-aware and scoped to page lifetime.\n\n###  Startup Manager\n- Moved heavy inventory, toggle, delay, and auto-redisable operations **off the UI thread**.\n- UI updates remain on the dispatcher for safety.\n- Improved scroll smoothness via bitmap caching, tuned virtualization, and deferred scrolling.\n- Auto-scroll now reliably scrolls to top after paging, even when overview is toggled.\n\n###  Deep Scan\n- Heavy scan and force-delete work now runs on background threads.\n- Pagination auto-scrolls to top reliably.\n- Smoothed scrolling with tuned virtualization, card bitmap caching, and reduced redraw cost.\n- Increased scan parallelism (up to `min(2 × cores, 16)`).\n- Added **incremental scan cache** to reuse results when targets haven’t changed.\n- Preset picker replaced with a modal overlay list (virtualized, click-off-to-close).\n- Added live scan progress (items, bytes, current path) + top progress strip UI.\n- Unified byte-size formatting across summaries.\n\n###  Cleanup\n- Preview fetching and materialization now run off the UI thread with batched UI updates.\n- Smoother scrolling on all screen sizes via softer shadows and higher virtualization cache.\n- Delete confirmation now opens **instantly** while prep runs asynchronously.\n- Added lightweight loading overlay during confirmation prep.\n- Risk calculation refactored into a pure helper to support background execution.\n\n###  Bootstrap & Install UX\n- PowerShell callout now stays visible until a **successful detection run** completes.\n- Loader overlays now correctly block clicks during fade transitions and release afterward.\n- Prevents accidental interaction during install/update/uninstall animations.\n\n###  Known Processes\n- Enabled list virtualization with recycling and pixel scrolling for smoother navigation.\n\n---\n\nThanks for sticking with the rapid updates 🙏  \nFrom here on out: **fewer releases**",
  "downloadUrl": "https://github.com/Cosmos-0118/TidyWindow/releases/download/v4.1.0/TidyWindow-Setup-4.1.0.exe",
  "releaseNotesUrl": "https://github.com/Cosmos-0118/TidyWindow/releases/tag/v4.1.0",
  "publishedAt": "2026-01-25T06:08:07Z",
  "installerSizeBytes": 91106976,
  "sha256": "d9dcf7d223c7f44ff5849b210d92705fac0f40ba8f20379b68f6e97e79e1b27a"
}
